mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FMK_CDA/Src/FMK_CDA.c
/*********************************************************************
 * @file        FMK_IO.c
 * @brief       Template_BriefDescription.
 * @details     TemplateDetailsDescription.\n
 *
 * @author      xxxxxx
 * @date        jj/mm/yyyy
 * @version     1.0
 */






// ********************************************************************
// *                      Includes
// ********************************************************************
#include "./FMK_CDA.h"
#include "FMK_HAL/FMK_MAC/Src/FMK_MAC.h"
#include "FMK_HAL/FMK_CPU/Src/FMK_CPU.h"
#include "FMK_CFG/FMKCFG_ConfigFiles/FMKCDA_ConfigPrivate.h"
#include "stm32f0xx_hal.h"

// ********************************************************************
// *                      Defines
// ********************************************************************
#define FMKCDA_CHNLCFG_PER_CYCLE ((t_uint8)5) /* Number of channel configuration per Cycle*/
// ********************************************************************
// *                      Types
// ********************************************************************
//-----------------------------ENUM TYPES-----------------------------//
/* CAUTION : Automatic generated code section for Enum: Start */

/* CAUTION : Automatic generated code section for Enum: End */
/* Channel error status*/
typedef enum 
{   
    FMKCDA_CHANNEL_STATE_OK = 0,
    FMKCDA_CHANNEL_STATE_ERR_INTERNAL,
    FMKCDA_CHANNEL_STATE_ERR_OVR,
    FMKCDA_CHANNEL_STATE_ERR_DMA,
    FMKCDA_CHANNEL_STATE_CB,
    FMKCDA_CHANNEL_STATE_JQOVF,

    FMKCDA_CHANNEL_STATE_NB
} t_eFMKCDA_ChnlErrState;


//-----------------------------TYPEDEF TYPES---------------------------//
//-----------------------------STRUCT TYPES---------------------------//
/* CAUTION : Automatic generated code section for Structure: Start */

/* CAUTION : Automatic generated code section for Structure: End */

typedef struct
{
    t_uint16 rawValue_au16[FMKCDA_ADC_CHANNEL_NB];
    t_uint8  BspChnlmapp[FMKCDA_ADC_CHANNEL_NB];
    t_bool   FlagValueUpdated_b;
} t_sFMKCDA_AdcBuffer;

/* Structure for adc channel info*/
typedef struct
{
    t_uint16                  rawValue_u16;
    t_bool                    FlagValueUpdated_b;
    t_bool                    IsChnlUsed_b;
    t_bool                    IsChnlConfigured_b;
    t_eFMKCDA_ChnlErrState    Error_e;
} t_sFMKCDA_ChnlInfo;

/* Structure for adc info*/
typedef struct
{
    ADC_HandleTypeDef         BspInit_s;
    t_eFMKCDA_HwAdcCfg        HwCfg_e;
    t_sFMKCDA_ChnlInfo        Channel_as[FMKCDA_ADC_CHANNEL_NB];
    const t_eFMKCPU_ClockPort clock_e;
    const t_eFMKCPU_IRQNType  IRQNType_e;
    t_bool                    IsAdcConfigured_b;
    t_bool                    IsAdcRunning_b;
} t_sFMKCDA_AdcInfo;
// ********************************************************************
// *                      Prototypes
// ********************************************************************
	
// ********************************************************************
// *                      Variables
// ********************************************************************
/*store the raw value for each channel of each adc converter*/
t_sFMKCDA_AdcBuffer g_AdcBuffer_as[FMKCDA_ADC_NB];
// Flag automatic generate code 
/* Store the Adc Info variable*/
t_sFMKCDA_AdcInfo g_AdcInfo_as[FMKCDA_ADC_NB] = {
    {// ADC_1
        .BspInit_s.Instance = ADC1,
        .clock_e = FMKCPU_RCC_CLK_ADC1,
        .IRQNType_e = ADC1_IRQn,
    }
};

t_eCyclicFuncState g_state_e = STATE_CYCLIC_WAITING;

//********************************************************************************
//                      Local functions - Prototypes
//********************************************************************************
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKCDA_Get_BspChannel(t_eFMKCDA_AdcChannel f_channel_e, t_uint32 *f_bspChannel_32);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKCDA_Set_BspAdcCfg(t_eFMKCDA_Adc f_Adc_e,
                                             t_eFMKCDA_HwAdcCfg f_HwAdcCfg_e);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKCDA_Set_BspChannelCfg(t_eFMKCDA_Adc f_Adc_e, t_eFMKCDA_AdcChannel f_channel_e);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKCDA_PreOperational(void);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKCDA_Operational(void);
//****************************************************************************
//                      Public functions - Implementation
//********************************************************************************
/*********************************
* FMKCDA_Init
*********************************/
t_eReturnState FMKCDA_Init(void)
{
    t_uint8 LLI1_u8 = 0;
    t_uint8 LLI2_u8 = 0;
    // initiate to default value variable structure 
    for(LLI1_u8 = (t_uint8)0 ; LLI1_u8 < (t_uint8)FMKCDA_ADC_NB ; LLI1_u8++)
    {// all timer
        g_AdcInfo_as[LLI1_u8].IsAdcConfigured_b = (t_bool)False;
        g_AdcInfo_as[LLI1_u8].IsAdcRunning_b = (t_bool)False;

        for(LLI2_u8 = (t_uint8)0 ; LLI2_u8 < (t_uint8)FMKCDA_ADC_CHANNEL_NB ; LLI2_u8++)
        {// all channel for a timer
            g_AdcInfo_as[LLI1_u8].Channel_as[LLI2_u8].IsChnlConfigured_b = (t_bool)False;
            g_AdcInfo_as[LLI1_u8].Channel_as[LLI2_u8].Error_e            = FMKCDA_CHANNEL_STATE_OK;
            g_AdcInfo_as[LLI1_u8].Channel_as[LLI2_u8].IsChnlUsed_b       = (t_bool)False;
            g_AdcInfo_as[LLI1_u8].Channel_as[LLI2_u8].rawValue_u16       = (t_uint16)0;
        }
    }
    return RC_OK;
}


