mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FMK_CDA/Src/FMK_CDA.c
/*********************************
* FMKCDA_Init
*********************************/
t_eReturnState FMKCDA_Cyclic(void)
{
    t_eReturnState Ret_e = RC_OK;

    switch(g_state_e)
    {
        case STATE_CYCLIC_PREOPE:
        {
            Ret_e = s_FMKCDA_PreOperational();
            break;
        }
        case STATE_CYCLIC_OPE:
        {
            Ret_e = s_FMKCDA_Operational();
            break;
        }
        case STATE_CYCLIC_WAITING:
        {
            break;
        }
        case STATE_CYCLIC_ERROR:
        {
            break;
        }
        case STATE_CYCLIC_BUSY:
        default:
            Ret_e = RC_OK;
            break;
    }
    return Ret_e;
}
/*********************************
* FMKCDA_AddAdcChannelCfg
*********************************/
t_eReturnState FMKCDA_AddAdcChannelCfg(t_eFMKCDA_Adc f_Adc_e, 
                                       t_eFMKCDA_AdcChannel f_channel_e,
                                       t_eFMKCDA_HwAdcCfg   f_adcCfg_e)
{
    t_eReturnState Ret_e = RC_OK;
    static t_bool s_IsAdcCfgSet_b[FMKCDA_ADC_NB];
    if(f_Adc_e > FMKCDA_ADC_NB
    || f_channel_e > FMKCDA_ADC_CHANNEL_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        // Update information depending on wtehter the Adc has already been configured by a precedent call
        switch(s_IsAdcCfgSet_b[f_Adc_e])
        {
            case False:
            {
                s_IsAdcCfgSet_b[f_Adc_e] = (t_bool)True;
                g_AdcInfo_as[f_Adc_e].HwCfg_e = f_adcCfg_e;
                g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].IsChnlUsed_b = (t_bool)True;
                break;
            }

            case True:
            {
                // verify cfg -> once on Adc config is set for a channel the other channel must have the same cfg
                if(g_AdcInfo_as[f_Adc_e].HwCfg_e != f_adcCfg_e)
                {
                    Ret_e = RC_ERROR_WRONG_CONFIG;
                }
                else 
                {
                    g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].IsChnlUsed_b = (t_bool)True;
                }
                break;
            }
            default:
                Ret_e = RC_WARNING_NO_OPERATION;
                break;
        }
    }
    return Ret_e;
}

/*********************************
* FMKCDA_Get_AnaChannelMeasure
*********************************/
t_eReturnState FMKCDA_Get_AnaChannelMeasure(t_eFMKCDA_Adc f_Adc_e, t_eFMKCDA_AdcChannel f_channel_e, t_uint16 *f_AnaMeasure_u16)
{
    t_eReturnState Ret_e = RC_OK;

    if(f_Adc_e > FMKCDA_ADC_NB
    || f_channel_e > FMKCDA_ADC_CHANNEL_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_AnaMeasure_u16 == (t_uint16 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        // give the last raw analog value if value is updated 
        if(g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].FlagValueUpdated_b == (t_bool)True)
        {
            *f_AnaMeasure_u16 = g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].rawValue_u16;
        }
        else 
        {
            *f_AnaMeasure_u16 = (t_uint16)0;
            Ret_e = RC_ERROR_BUSY;
        }
    }
    return Ret_e;
}
//********************************************************************************
//                      Local functions - Implementation
//********************************************************************************
/*********************************
* s_FMKCDA_Operational
*********************************/
static t_eReturnState s_FMKCDA_Operational(void)
{
    t_eReturnState Ret_e = RC_OK;
    t_uint8 timerCnt_u8 = 0;
    t_uint8 chnlCnt_u8 = 0;
    t_uint8 rankInBuffer_u8 = 0;
    
    for(timerCnt_u8 = (t_uint8)0 ; timerCnt_u8 < (t_uint8)FMKCDA_ADC_NB ; timerCnt_u8++)
    {
        if(g_AdcBuffer_as[timerCnt_u8].FlagValueUpdated_b == (t_bool)True)
        {
            for(chnlCnt_u8 = (t_uint8)0 ; chnlCnt_u8 < (t_uint8)FMKCDA_ADC_CHANNEL_NB ; chnlCnt_u8++)
            {
                if(g_AdcInfo_as[timerCnt_u8].Channel_as[chnlCnt_u8].IsChnlUsed_b == (t_bool)True)
                {
                    rankInBuffer_u8 = g_AdcBuffer_as[timerCnt_u8].BspChnlmapp[chnlCnt_u8];
                    g_AdcInfo_as[timerCnt_u8].Channel_as[chnlCnt_u8].rawValue_u16 = 
                        g_AdcBuffer_as[timerCnt_u8].rawValue_au16[rankInBuffer_u8];
                }
                    
            }
        }
    }
    #warning "ADC SCAN not set"
    return Ret_e;
}
/*********************************
* s_FMKCDA_PreOperational
*********************************/
static t_eReturnState s_FMKCDA_PreOperational(void)
{
    t_eReturnState Ret_e = RC_OK;
    t_uint8 LLI_u8 = 0;
    static t_uint8 s_timerCnt_u8 = 0; 
    static t_uint8 s_chnlCnt_u8 = 0; 
    static t_bool s_IsAdcCfgDone_b = (t_bool)False;

    // Initialisation des ADC
    if(s_IsAdcCfgDone_b == (t_bool)False)
    {
        for(LLI_u8 = (t_uint8)0 ; (LLI_u8 < (t_uint8)FMKCDA_ADC_NB && Ret_e == RC_OK) ; LLI_u8++)
        {
            Ret_e = s_FMKCDA_Set_BspAdcCfg((t_eFMKCDA_Adc)LLI_u8,
                                            g_AdcInfo_as[LLI_u8].HwCfg_e);
            if(Ret_e == RC_OK)
            {
                // Initiasation du DMA pour l'instant on considère que tout est SCan DMA
                #warning "Only Scan/DMA mode is trreated for AdcChannel Configuration"
                Ret_e = FMKMAC_RqstDmaInit(FMKMAC_DMA_RQSTYPE_ADC1, (void *)&g_AdcInfo_as[LLI_u8].BspInit_s);
            }
        }
        
        if(LLI_u8 == FMKCDA_ADC_NB && Ret_e == RC_OK)
        {
            s_IsAdcCfgDone_b = (t_bool)True;
        }

    }
    // Initialisation des canaux ADC
    else
    {
        // Configurer 5 canaux par appel
        for(; s_chnlCnt_u8 < (t_uint8)(s_chnlCnt_u8 + FMKCDA_CHNLCFG_PER_CYCLE); s_chnlCnt_u8++)
        {
            if(s_timerCnt_u8 < FMKCDA_ADC_NB && 
               s_chnlCnt_u8 < FMKCDA_ADC_CHANNEL_NB &&
               g_AdcInfo_as[s_timerCnt_u8].Channel_as[s_chnlCnt_u8].IsChnlUsed_b == (t_bool)True)
            {
                Ret_e = s_FMKCDA_Set_BspChannelCfg((t_eFMKCDA_Adc)s_timerCnt_u8,
                                                    (t_eFMKCDA_AdcChannel)s_chnlCnt_u8);
                if(Ret_e != RC_OK)
                {
                    break;  // Arrêter la configuration si une erreur se produit
                }
            }
            
