mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FMK_CDA/Src/FMK_CDA.c
            // Passer au prochain ADC si tous les canaux de l'ADC actuel sont configurés
            if(s_chnlCnt_u8 >= FMKCDA_ADC_CHANNEL_NB - 1)
            {
                s_chnlCnt_u8 = 0; // Réinitialiser le compteur des canaux
                s_timerCnt_u8++;  // Passer au prochain ADC
                
                if(s_timerCnt_u8 >= FMKCDA_ADC_NB)
                {
                    break;  // Arrêter si tous les ADC ont été configurés
                }
            }
        }
        
        // Si tous les canaux de tous les ADC sont configurés, changer d'état
        if(s_timerCnt_u8 >= FMKCDA_ADC_NB && s_chnlCnt_u8 >= FMKCDA_ADC_CHANNEL_NB)
        {
            g_state_e = STATE_CYCLIC_OPE;
        }
    }
    return Ret_e;
}
/*********************************
* s_FMKCDA_Get_BspChannel
*********************************/
static t_eReturnState s_FMKCDA_Get_BspChannel(t_eFMKCDA_AdcChannel f_channel_e, t_uint32 *f_bspChannel_32)
{
    t_eReturnState Ret_e = RC_OK;
    if(f_channel_e > FMKCDA_ADC_CHANNEL_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_bspChannel_32 == (t_uint32*)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_channel_e)
        {
            case FMKCDA_ADC_CHANNEL_0:
                *f_bspChannel_32 = ADC_CHANNEL_0;
                break;
            case FMKCDA_ADC_CHANNEL_1:
                *f_bspChannel_32 = ADC_CHANNEL_1;
                break;
            case FMKCDA_ADC_CHANNEL_2:
                *f_bspChannel_32 = ADC_CHANNEL_2;
                break;
            case FMKCDA_ADC_CHANNEL_3:
                *f_bspChannel_32 = ADC_CHANNEL_3;
                break;
            case FMKCDA_ADC_CHANNEL_4:
                *f_bspChannel_32 = ADC_CHANNEL_4;
                break;
            case FMKCDA_ADC_CHANNEL_5:
                *f_bspChannel_32 = ADC_CHANNEL_5;
                break;
            case FMKCDA_ADC_CHANNEL_6:
                *f_bspChannel_32 = ADC_CHANNEL_6;
                break;
            case FMKCDA_ADC_CHANNEL_7:
                *f_bspChannel_32 = ADC_CHANNEL_7;
                break;
            case FMKCDA_ADC_CHANNEL_8:
                *f_bspChannel_32 = ADC_CHANNEL_8;
                break;
            case FMKCDA_ADC_CHANNEL_9:
                *f_bspChannel_32 = ADC_CHANNEL_9;
                break;
            case FMKCDA_ADC_CHANNEL_10:
                *f_bspChannel_32 = ADC_CHANNEL_10;
                break;
            case FMKCDA_ADC_CHANNEL_11:
                *f_bspChannel_32 = ADC_CHANNEL_11;
                break;
            case FMKCDA_ADC_CHANNEL_12:
                *f_bspChannel_32 = ADC_CHANNEL_12;
                break;
            case FMKCDA_ADC_CHANNEL_13:
                *f_bspChannel_32 = ADC_CHANNEL_13;
                break;  
            case FMKCDA_ADC_CHANNEL_14:
                *f_bspChannel_32 = ADC_CHANNEL_14;
                break;
            case FMKCDA_ADC_CHANNEL_15:
                *f_bspChannel_32 = ADC_CHANNEL_15;
                break;
            case FMKCDA_ADC_CHANNEL_16:
                *f_bspChannel_32 = ADC_CHANNEL_16;
                break;
            case FMKCDA_ADC_CHANNEL_17:
                *f_bspChannel_32 = ADC_CHANNEL_17;
                break;
            case FMKCDA_ADC_CHANNEL_NB:
            default:
                Ret_e = RC_WARNING_NO_OPERATION;
        }
    }
    return Ret_e;
}

/*********************************
* s_FMKCDA_Set_BspAdcCfg
*********************************/
static t_eReturnState s_FMKCDA_Set_BspAdcCfg(t_eFMKCDA_Adc f_Adc_e,
                                             t_eFMKCDA_HwAdcCfg f_HwAdcCfg_e)
{
    t_eReturnState Ret_e = RC_OK;
    HAL_StatusTypeDef BspRet_e = HAL_OK;
    ADC_InitTypeDef  * bspAdcInit_s;

    if(f_Adc_e > FMKCDA_ADC_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        bspAdcInit_s = &g_AdcInfo_as[f_Adc_e].BspInit_s.Init;
        // Set shared Init varaible 
        bspAdcInit_s->ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;
        bspAdcInit_s->Resolution            = ADC_RESOLUTION_12B;
        bspAdcInit_s->DataAlign             = ADC_DATAALIGN_RIGHT;
        bspAdcInit_s->SamplingTimeCommon    = ADC_SAMPLETIME_13CYCLES_5; // Assuming a default value
        bspAdcInit_s->EOCSelection          = ADC_EOC_SEQ_CONV;
        bspAdcInit_s->LowPowerAutoPowerOff  = ENABLE;
        switch (f_HwAdcCfg_e)
        {
            case FMKCDA_ADC_CFG_BASIC_REGISTER:
            {
                bspAdcInit_s->ScanConvMode          = DISABLE;
                bspAdcInit_s->ContinuousConvMode    = DISABLE;
                bspAdcInit_s->DiscontinuousConvMode = DISABLE;
                bspAdcInit_s->DMAContinuousRequests = DISABLE;
                bspAdcInit_s->ExternalTrigConv      = ADC_SOFTWARE_START;
                bspAdcInit_s->ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
                break;
            }
            case FMKCDA_ADC_CFG_PERIODIC_INTERRUPT:
            {
                bspAdcInit_s->ScanConvMode = DISABLE;
                bspAdcInit_s->ContinuousConvMode = ENABLE;
                bspAdcInit_s->DiscontinuousConvMode = DISABLE;
                bspAdcInit_s->DMAContinuousRequests = DISABLE;
                bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
                bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
                break;
            }
            case FMKCDA_ADC_CFG_PERIODIC_DMA:
            {
                bspAdcInit_s->ScanConvMode = DISABLE;
                bspAdcInit_s->ContinuousConvMode = ENABLE;
                bspAdcInit_s->DiscontinuousConvMode = DISABLE;
                bspAdcInit_s->DMAContinuousRequests = ENABLE;
                bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
                bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
                break;
            }
            case FMKCDA_ADC_CFG_SCAN_INTERRUPT:
            {
                bspAdcInit_s->ScanConvMode = ENABLE;
                bspAdcInit_s->ContinuousConvMode = DISABLE;
                bspAdcInit_s->DiscontinuousConvMode = DISABLE;
                bspAdcInit_s->DMAContinuousRequests = DISABLE;
                bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
                bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
                break;
            }
            case FMKCDA_ADC_CFG_SCAN_DMA:
            {
                bspAdcInit_s->ScanConvMode = ADC_SCAN_ENABLE;
                bspAdcInit_s->ContinuousConvMode = DISABLE;
                bspAdcInit_s->DiscontinuousConvMode = DISABLE;
                bspAdcInit_s->DMAContinuousRequests = ENABLE;
                bspAdcInit_s->ExternalTrigConv = ADC_SOFTWARE_START;
                bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
                break;
            }
            case FMKCDA_ADC_CFG_TRIGGERED_REGISTER:
            {
                bspAdcInit_s->ScanConvMode = DISABLE;
                bspAdcInit_s->ContinuousConvMode = DISABLE;
                bspAdcInit_s->DiscontinuousConvMode = DISABLE;
                bspAdcInit_s->DMAContinuousRequests = DISABLE;
                bspAdcInit_s->ExternalTrigConv = ADC_EXTERNALTRIGCONV_T1_CC4; // Example trigger source
                bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
                break;
            }
            case FMKCDA_ADC_CFG_TRIGGERED_INTERRUPT:
            {
                bspAdcInit_s->ScanConvMode = DISABLE;
                bspAdcInit_s->ContinuousConvMode = DISABLE;
                bspAdcInit_s->DiscontinuousConvMode = DISABLE;
                bspAdcInit_s->DMAContinuousRequests = DISABLE;
                bspAdcInit_s->ExternalTrigConv     = ADC_EXTERNALTRIGCONV_T1_CC4; // Example trigger source
                bspAdcInit_s->ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
                break;
            }
            case FMKCDA_ADC_CFG_TRIGGERED_DMA:
            {
                bspAdcInit_s->ScanConvMode          = DISABLE;
                bspAdcInit_s->ContinuousConvMode    = DISABLE;
                bspAdcInit_s->DiscontinuousConvMode = DISABLE;
                bspAdcInit_s->DMAContinuousRequests = ENABLE;
                bspAdcInit_s->ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T1_CC4; // Example trigger source
                bspAdcInit_s->ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_RISING;
                break;
            }
            case FMKCDA_ADC_CFG_NB:
            default:
                Ret_e = RC_WARNING_NO_OPERATION;
        }
        // CAllBsp Func
        BspRet_e = HAL_ADC_Init(&g_AdcInfo_as[f_Adc_e].BspInit_s);
        if(BspRet_e == HAL_OK)
        {
            Ret_e = FMKCPU_Set_HwClock(g_AdcInfo_as[f_Adc_e].clock_e, FMKCPU_CLOCKPORT_OPE_ENABLE);
            if(Ret_e == RC_OK)
            {
                g_AdcInfo_as[f_Adc_e].IsAdcConfigured_b = (t_bool)True;
            }
        }
        else 
        {
            Ret_e = RC_ERROR_WRONG_STATE;
        }
    }
    return Ret_e;
}

