mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FMK_CDA/Src/FMK_CDA.c
/*********************************
* s_FMKCDA_Set_BspChannelCfg
*********************************/
static t_eReturnState s_FMKCDA_Set_BspChannelCfg(t_eFMKCDA_Adc f_Adc_e, t_eFMKCDA_AdcChannel f_channel_e)
{
    t_eReturnState Ret_e = RC_OK;
    HAL_StatusTypeDef BspRet_e = HAL_OK;
    t_uint32 bspChannel_u32 = 0;
    static t_uint8 counterRank_u8 = 0;

    ADC_ChannelConfTypeDef BspChannelInit_s = {.SamplingTime = ADC_SAMPLETIME_13CYCLES_5}; // all channel ave this cfg

    if(f_Adc_e > FMKCDA_ADC_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        // configure channel
        Ret_e = s_FMKCDA_Get_BspChannel(f_channel_e, &bspChannel_u32);

        if(Ret_e == RC_OK)
        {
            BspChannelInit_s.Channel      = bspChannel_u32;
            BspChannelInit_s.Rank         = counterRank_u8;
            BspRet_e = HAL_ADC_ConfigChannel(&g_AdcInfo_as[f_Adc_e].BspInit_s,
                                    &BspChannelInit_s);

            if(BspRet_e == HAL_OK)
            {
                // update mapping
                g_AdcBuffer_as[f_Adc_e].BspChnlmapp[f_channel_e] = counterRank_u8;
                g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].IsChnlConfigured_b = (t_bool)True;
                counterRank_u8 += (t_uint8)1;
            }
            else
            {
                Ret_e = RC_ERROR_WRONG_STATE;
            }
        }
    }
    return Ret_e;
}

//********************************************************************************
//                      HAL_Callback Implementation
//********************************************************************************
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
    t_uint8 LLI_u8 = 8;
    t_eFMKCDA_Adc IT_Adc_e = FMKCDA_ADC_NB;
    for (LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKCDA_ADC_NB ; LLI_u8++)
    {
        if(&g_AdcInfo_as[LLI_u8].BspInit_s == (ADC_HandleTypeDef *)hadc)
        {
            IT_Adc_e = (t_eFMKCDA_Adc)LLI_u8;
            break;
        }
    }
    if(IT_Adc_e < FMKCDA_ADC_NB)
    {
        g_AdcBuffer_as[LLI_u8].FlagValueUpdated_b = (t_bool)True;
    }
    return;
}
//************************************************************************************
// End of File
//************************************************************************************

/**
 *
 *	@brief
 *	@details
 *
 *
 *	@params[in] 
 *	@params[out]
 *	 
 *
 *
 */
